{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hello",
        "Hi",
        "Hey",
        "Good morning",
        "Good evening"
      ],
      "responses": [
        "Hello! How can I assist you today?",
        "Hi there! How can I help with your learning journey?",
        "Hey! Looking for a specific course or topic?"
      ]
    },
    {
      "tag": "course_inquiry",
      "patterns": [
        "Can you tell me about the courses available?",
        "What courses do you offer?",
        "I'm looking for a specific course",
        "Courses available?"
      ],
      "responses": [
        "We offer courses in various subjects like Math, Science, and Engineering (DSA, Web Development, Data Science). Could you specify your area of interest?",
        "Our platform provides a range of courses. Let me know your preferred topic, and I'll share more details!"
      ]
    },
    {
      "tag": "course_enrollment",
      "patterns": [
        "How do I enroll in a course?",
        "Can you help me with the enrollment process?",
        "I want to sign up for a course"
      ],
      "responses": [
        "To enroll, visit the Courses page, select your preferred course, and click 'Enroll Now'. Follow the instructions to complete registration.",
        "You can sign up by visiting the course page and clicking 'Enroll'. Let me know if you face any issues!"
      ]
    },
    {
      "tag": "course_fee",
      "patterns": [
        "What is the fee for the courses?",
        "Are there any free courses?",
        "How much does a course cost?"
      ],
      "responses": [
        "Some introductory courses are free, while others have a one-time or subscription-based fee. You can check individual course pages for exact pricing.",
        "We offer both free and paid courses. Visit the course catalog to see specific prices."
      ]
    },
    {
      "tag": "schedule",
      "patterns": [
        "When are the classes scheduled?",
        "Can I access the course materials anytime?",
        "What is the course schedule?"
      ],
      "responses": [
        "Our courses are self-paced, so you can access materials anytime. For live sessions, check the schedule on your course dashboard.",
        "Most classes are flexible and available 24/7. For scheduled live sessions, refer to your course details."
      ]
    },
    {
      "tag": "technical_support",
      "patterns": [
        "I'm having trouble accessing my course",
        "The platform isn't loading",
        "I need help with technical issues"
      ],
      "responses": [
        "I'm here to help! Please describe the issue, or contact our support team at support@example.com.",
        "Try refreshing the page or clearing your cache. If the problem persists, reach out to our support team."
      ]
    },
    {
      "tag": "certificate",
      "patterns": [
        "Do I get a certificate after completing a course?",
        "Is there a certificate for this course?",
        "Will I receive certification?"
      ],
      "responses": [
        "Yes, you will receive a certificate upon successful completion. You can download it from your profile.",
        "Certificates are awarded after completing most courses. You'll find yours in your profile upon completion."
      ]
    },
    {
      "tag": "farewell",
      "patterns": [
        "Thank you",
        "Thanks for the help",
        "Goodbye",
        "See you later"
      ],
      "responses": [
        "You're welcome! Reach out anytime if you need more assistance.",
        "Goodbye! Happy learning, and feel free to ask if you have more questions!",
        "Thank you for chatting with us. Have a great day!"
      ]
    }
  ]
}
